БИТУправление_медицинским_центром_демо/src/Documents/ОписьЗаказовЛаборатории/ОписьЗаказовЛаборатории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОписьЗаказовЛаборатории</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ЛабораторныеИсследования</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Лаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗаказов</name>
    <attributes>
      <name>ЗаказВЛабораторию</name>
      <type>
        <types>DocumentRef.ЗаказВоВнешнююЛабораторию</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/ЗаказВоВнешнююЛабораторию/ЗаказВоВнешнююЛабораторию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказВоВнешнююЛабораторию</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ЛабораторныеИсследования</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаказовЛаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьРезультат</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Лаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>Анонимно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказаВнешнейЛаборатории</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Исследования</name>
    <attributes>
      <name>КодПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияЗаказовЛаборатории</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Результаты</name>
    <attributes>
      <name>КодПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/ДействияНадАнализами/ДействияНадАнализами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДействияНадАнализами</name>
  <registerRecords>InformationRegister.удалитьИсследования</registerRecords>
  <registerRecords>InformationRegister.ЛабораторныеИсследования</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийАнализов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеИсследований</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеКлиентов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ОказаниеУслуг</types>
      <types>DocumentRef.Прием</types>
    </type>
  </attributes>
  <attributes>
    <name>Анонимно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>InvЗаявка</name>
    <type>
      <types>DocumentRef.invЗаявкаНаИсследование</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Исследования</name>
    <attributes>
      <name>КодПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лаборатория</name>
      <type>
        <types>CatalogRef.Лаборатории</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПравилаВнешнихЛабораторий</name>
    <attributes>
      <name>КлючСтрокиИсследования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдПравила</name>
      <comment>Идентификатор правила забора внешней лаборатории</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обязательное</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Биоматериал</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДКонтейнера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДБиоматериала</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыборНесколькихПравилЗабора</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыЗабора</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыЗабораАнализов</types>
        <types>ChartOfCharacteristicTypesRef.invЛабораторныеПараметры</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПараметрыЗабораАнализов</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <comment>Параметр был обязательный на момент забора анализа</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Заполнен</name>
      <comment>Пустое значение тоже может быть результатом ручного заполнения</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контейнеры</name>
    <attributes>
      <name>НомерКонтейнера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтрокиИсследования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерПредставление</name>
      <comment>Для Helix - DESCRIPTION_CONT</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдАнализа</name>
      <comment>ИД анализа во внешней лаборатории (для Helix - ITEM_CODE)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Биоматериал</name>
      <comment>Для Helix - SAMPLE_TYPE</comment>
      <type>
        <types>String</types>
        <types>CatalogRef.ВнутренняяЛаборатория_Биоматериалы</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловияХранения</name>
      <comment>Для Helix - STORAGE_CONDITIONS</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контейнер</name>
      <comment>Для Helix - CONTAINER_TYPE</comment>
      <type>
        <types>CatalogRef.ВнутренняяЛаборатория_ВидыКонтейнеров</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БиоматериалПредставление</name>
      <comment>Для Helix - DESCRIPTION_MAT</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдПравила</name>
      <comment>ИД правила забора анализа внешней лаборатории (если используются лабораторией)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лаборатория</name>
      <type>
        <types>CatalogRef.Лаборатории</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветКонтейнера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловияТранспортировки</name>
      <comment>Для Helix - SAMPLE_TRANSPORT</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеАнализа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдИсследования</name>
      <comment>УИД исследования в регистре лабораторных исследований</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/ОписьЗаказовЛаборатории/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает доступные варианты печати документа.
//  Результатом является Струткура, каждая строка которой соответствует одному из вариантов печати.
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("ОписьЗаказов", "Опись заказов");

	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура формирует печатную форму документа
//  Название макета печати передается в качестве параметра,
//  по переданному имени макета определяется соответствующая функция печати.
//
// Параметры:
//  СсылкаНаОбъект	 - ДокументСсылка	 - ссылка на распечатываемый документ.
//  ИмяМакета		 - Строка			 - имя макета из структуры печатных форм.
// 
// Возвращаемое значение:
//  ТабличныйДокумент.
//
Функция Печать(СсылкаНаОбъект, ИмяМакета) Экспорт
	
	Перем ТабДокумент;
	
	Если ИмяМакета = "ОписьЗаказов" Тогда
		ТабДокумент = ПечатьОписьЗаказов(СсылкаНаОбъект);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьОписьЗаказов(СсылкаНаОбъект)
	
	// Получение формы лаборатории
	ТабДокумент = ЛабораторияСервер.ПечатьОписиЗаказовДляЛаборатории(СсылкаНаОбъект);
	Если ТабДокумент <> Неопределено Тогда
		Возврат ТабДокумент;
	КонецЕсли;
	
	// Печать общей формы
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.ОтображатьЗаголовки = Истина;
	ТабДокумент.ОтображатьСетку = Ложь;
	
	Лаборатория = СсылкаНаОбъект.Лаборатория;
	
	Макет = ПолучитьМакет("ОписьЗаказов");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.МестоЗабора = ЛабораторияСервер.ПолучитьМестоЗабораИсследований(Лаборатория, СсылкаНаОбъект.Филиал);
	ОбластьМакета.Параметры.ДатаФормирования = Формат(ТекущаяДата(), "ДЛФ=DD");
	ТабДокумент.Вывести(ОбластьМакета);
	
	мсОписьЗаказов = СсылкаНаОбъект.СписокЗаказов.ВыгрузитьКолонку("ЗаказВЛабораторию");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаказВоВнешнююЛабораториюИсследования.ИД КАК ИД,
	                      |	ЗаказВоВнешнююЛабораториюИсследования.КодПробы КАК КодПробы,
	                      |	ЗаказВоВнешнююЛабораториюИсследования.Ссылка.Лаборатория КАК Лаборатория
	                      |ПОМЕСТИТЬ Заказ
	                      |ИЗ
	                      |	Документ.ЗаказВоВнешнююЛабораторию.Исследования КАК ЗаказВоВнешнююЛабораториюИсследования
	                      |ГДЕ
	                      |	ЗаказВоВнешнююЛабораториюИсследования.Ссылка В(&мсОписьЗаказов)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ДействияНадАнализамиКонтейнеры.КодПробы КАК КодПробы,
	                      |	ДействияНадАнализамиКонтейнеры.БиоматериалПредставление КАК Биоматериал,
	                      |	ДействияНадАнализамиКонтейнеры.КонтейнерПредставление КАК Контейнер,
	                      |	ДействияНадАнализамиКонтейнеры.УсловияТранспортировки КАК Температура
	                      |ИЗ
	                      |	Документ.ДействияНадАнализами.Контейнеры КАК ДействияНадАнализамиКонтейнеры
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Заказ КАК Заказ
	                      |		ПО ДействияНадАнализамиКонтейнеры.ИдИсследования = Заказ.ИД
	                      |			И ДействияНадАнализамиКонтейнеры.КодПробы = Заказ.КодПробы
	                      |			И ДействияНадАнализамиКонтейнеры.Лаборатория = Заказ.Лаборатория
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	КодПробы");
	
	Запрос.УстановитьПараметр("мсОписьЗаказов",мсОписьЗаказов);
	Выборка = Запрос.Выполнить().Выбрать();	
	
	
	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Область = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДокумент.Вывести(ОбластьШапка);
	
	МассивПроверкаВывода = Новый Массив;
	МассивПроверкаВывода.Добавить(Область);
	МассивПроверкаВывода.Добавить(ОбластьПодвал);
	
	
	НомерПункта = 1;
	Пока Выборка.Следующий() Цикл 
		
		Область.Параметры.Пункт	 		  = НомерПункта;
		Область.Параметры.ОбразецНомер 	  = Выборка.КодПробы;
		Область.Параметры.ТипБиоматериала = Выборка.Биоматериал + ", " + Выборка.Контейнер;
		Область.Параметры.Температура	  = Выборка.Температура;
		
		Если Не ТабДокумент.ПроверитьВывод(МассивПроверкаВывода) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДокумент.Вывести(ОбластьШапка);
		КонецЕсли;
		
		ТабДокумент.Вывести(Область);
		НомерПункта = НомерПункта + 1;
		
	КонецЦикла;
	
	ОбластьПодвал.Параметры.Количество = Выборка.Количество();
	ТабДокумент.Вывести(ОбластьПодвал);
	
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОписьЗаказовЛаборатории_ОписьЗаказов";
		
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти
